---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.DisconnectedElements
source: html/029d3c7c-eaf6-222c-c800-6e7d573a8757.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.DisconnectedElements Property

Elements are disconnected!

## Syntax (C#)
```csharp
public static FailureDefinitionId DisconnectedElements { get; }
```